app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "I'm"], ["description", "de best"], ["created_at", "2017-11-27 07:52:27.730090"], ["updated_at", "2017-11-27 07:52:27.730090"]]
---
  def create
    Task.create(task_create_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @task = Task.find_by(id:params[:id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    task = Task.find_by(id: params[:id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 3]]
---
    task = Task.find_by(id: params[:id])
    if task
      task.destroy!